## Viewing and selecting data

In [3]:
import pandas as pd

In [6]:
#to read data from available data(eg-car-sales.csv) use this 
car_sales = pd.read_csv("car-sales.csv")
#this reads data to from csv file to the variable car_sales so to print use

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [7]:
# this .head() function returns top five rows of data
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [8]:
#for custom need rows use car_sales.head("no. of rows")
car_sales.head(6)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00

In [9]:
# simililarly for bottom rows 
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

## .loc & .iloc

In [17]:
#create a series
animals = pd.Series(["cat","dog","bird","panda","snake"],index=[0,3,9,8,3])
# for custom indexes to rows
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [18]:
animals.loc[3] 
# loc refers to index numbers in this case 3 has 2 items referred in series and gives the data assigned to that index.

3      dog
3    snake
dtype: object

In [19]:
animals.loc[9]

'bird'

In [20]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [21]:
animals.iloc[3]
#iloc refers not to index but to position in dataframe

'panda'

In [22]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [23]:
# these loc and iloc can  be used in slicing(just like in python) data
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [24]:
car_sales.loc[2:6]

     Make Colour  Odometer (KM)  Doors       Price
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [29]:
#to select particular column of data in below type in sq brackets the column name as below  
car_sales["Colour"]

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [31]:
#similarly we can just use "".column_name"
#but this syntax wont work if the column name has a space in it
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [32]:
car_sales[car_sales.Make=="Toyota"]
#this gives a condition to which type of data we want even in the column to display

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [34]:
car_sales[car_sales["Odometer (KM)"] > 50000]  #used different syntax because of space 
# only cars with more than 50000 km on odometer to display from column odometer

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
4  Nissan  White         213095      4  $3,500.00
5  Toyota  Green          99213      4  $4,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00